src/main/test/supply-chain/3-Calculation/0-Apply Tax/8-Tax Amounts/7-TC.03.07.03 - Seller_Buyer - no identical line parameters for grouping/0-TC.03.07.03 - Seller_Buyer - no identical line parameters for grouping/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax><!--Optional:-->
  <arg0><DocumentId>
    <SystemSourceId>FRIM001</SystemSourceId>
    <TransactionId/>
  </DocumentId>
  <AlternateDocumentId>
    <CustomField1>CustomField1</CustomField1>
    <CustomField2/>
    <CustomField3/>
    <CustomField4/>
    <CustomField5/>
    <CustomField6/>
    <CustomField7/>
    <CustomField8/>
    <CustomField9/>
    <CustomField10/>
  </AlternateDocumentId>
  <InvoiceLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </InvoiceLanguage>
  <CommunicationLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </CommunicationLanguage>
  <CalculationDecimalPlaces>2</CalculationDecimalPlaces>
  <PreviousInvoiceTaxCountry/>
  <TaxDecisionSet>
    <TaxDecisionSetId/>
    <SellerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </SellerTaxIndicator>
    <SellerTaxCountry/>
    <SellerTaxState/>
    <BuyerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </BuyerTaxIndicator>
    <BuyerTaxCountry/>
    <BuyerTaxState/>
    <CombinedTaxIndicator/>
    <CommercialIndicator/>
    <SellerTaxRegCountry/>
    <SellerTaxRegState/>
    <BuyerTaxRegCountry/>
    <BuyerTaxRegState/>
 
    <TaxComment>
      <TaxCommentType/>
      <TaxCommentText/>
    </TaxComment>
    <InvoiceCurrency>
      <CurrencyCode>EUR</CurrencyCode>
      <SellerLocalTaxCurrencyCode/>
      <BuyerLocalTaxCurrencyCode/>
    </InvoiceCurrency>
    <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
    <TaxInvoiceLine>
      <LineNumber>1</LineNumber>
      <ItemNo>1</ItemNo>
      <ItemType/>
      <UNSPSC>56000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.0</NetAmount>
      
       <VariableTaxSteeringInput>
    <ConsignorCountry/>
    <ConsignorState/>
    <ConsignorBusinessUnitCode/>
    <ConsignorBusinessUnitType/>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode/>
    <ConsigneeBusinessUnitType/>
    <CarrierCountry/>
    <CarrierState/>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
    
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>  
 
      
        
    </TaxInvoiceLine>
     <TaxInvoiceLine>
      <LineNumber>2</LineNumber>
      <ItemNo>3</ItemNo>
      <ItemType/>
      <UNSPSC>10200000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>11.0</NetAmount>
     <VariableTaxSteeringInput>
    <ConsignorCountry/>
    <ConsignorState/>
    <ConsignorBusinessUnitCode/>
    <ConsignorBusinessUnitType/>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode/>
    <ConsigneeBusinessUnitType/>
    <CarrierCountry/>
    <CarrierState/>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
   
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>  
 
     
        
    </TaxInvoiceLine>
    
    
    
  </TaxDecisionSet>
  <TaxDate>
    <TaxAlgorithmDate>2013-01-12</TaxAlgorithmDate>
    <TaxCalculationDate/>
  </TaxDate>
  <TaxModuleBehaviour>
    <SkipCalculation>N</SkipCalculation>
    <SkipDecision>N</SkipDecision>
  </TaxModuleBehaviour>
    <VariableTaxSteeringInput>
               <ConsignorCountry>TR</ConsignorCountry>
               <ConsignorState/>
               <ConsignorBusinessUnitCode>7008</ConsignorBusinessUnitCode>
               <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
               <ConsigneeCountry>TR</ConsigneeCountry>
               <ConsigneeState/>
               <ConsigneeBusinessUnitCode>2610</ConsigneeBusinessUnitCode>
               <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
               <CarrierCountry/>
               <CarrierState/>
               <CarrierBusinessUnitCode/>
               <CarrierBusinessUnitType/>
               <ShipmentStartCountry/>
               <ShipmentEndCountry/>
               <ShipmentStartState/>
               <ShipmentEndState/>
               <ServiceRenderedCountry/>
               <ServiceRenderedState/>
               <ResalePurpose/>
               <IsOutBonded/>
               <IsInBonded/>
               <TaxPreAlgorithmOutput>
                  <IsExport>N</IsExport>
                  <IsImport>N</IsImport>
                  <IsExported>N</IsExported>
                  <IsImported>N</IsImported>
               </TaxPreAlgorithmOutput>
               <ShippingOfCustomsClearedGoods/>
            </VariableTaxSteeringInput>
            <BuyerParty>
               <Party>
                  <BusinessUnitCode>2610</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName>RETAIL CENTERS MANAGEMENT</BusinessUnitName>
                  <PartyAddress>
                     <AddressType/>
                     <City/>
                     <PostBox/>
                     <Street/>
                     <ZipCode/>
                     <CountryCode>TR</CountryCode>
                     <StateCode/>
                     <CountryOfLegalRegistration/>
                  </PartyAddress>
               </Party>
            </BuyerParty>
            <SellerParty>
               <Party>
                  <BusinessUnitCode>7008</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName>IKEA STIFTUNG</BusinessUnitName>
                  <PartyAddress>
                     <AddressType/>
                     <City/>
                     <PostBox/>
                     <Street/>
                     <ZipCode/>
                     <CountryCode>TR</CountryCode>
                     <StateCode/>
                     <CountryOfLegalRegistration/>
                  </PartyAddress>
               </Party>
            </SellerParty>
  <TermOfDelivery>DDU</TermOfDelivery></arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>